src/cf/InformationRegisters/СостоянияБанковскихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияБанковскихДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБанковскихДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОбменСБанками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОбмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецОбменСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СвязанныеОбъектыОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеОбъектыОбменСБанками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецОбменСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СообщениеОбмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыПлатежногоПоручения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоступленияПоСчету</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетаФактуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыЭДОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЭДОбменСБанками</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросЗонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтзывЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеЗачисленияДенежныхСредствНаСчетаСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеОткрытияСчетовПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПереводВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПокупкуВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПродажуВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспоряжениеНаОбязательнуюПродажуВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокНаЗачислениеДенежныхСредствНаСчетаСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокНаОткрытиеСчетовПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписокУволенныхСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправкаОПодтверждающихДокументах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОЗачисленииВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеестрВыплатСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеестрЧековВыплатСамозанятым</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаСамозанятому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбменСБанками</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненБанком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовленКОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзвещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПодписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыДокументовВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовВыплатыСамозанятым</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЧастичноЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ОбменСБанкамиПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиПереопределяемый: механизм обмена электронными документами с банками.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет массив актуальными видами электронных документов для прикладного решения.
//
// Параметры:
//  Массив - виды актуальных ЭД.
//
Процедура ПолучитьАктуальныеВидыЭД(Массив) Экспорт
	
	Массив.Добавить(Перечисления.ВидыЭДОбменСБанками.ПлатежноеПоручение);
	Массив.Добавить(Перечисления.ВидыЭДОбменСБанками.ЗапросВыписки);
	Массив.Добавить(Перечисления.ВидыЭДОбменСБанками.Письмо);
	Массив.Добавить(Перечисления.ВидыЭДОбменСБанками.РеестрВыплатСамозанятым);
	Массив.Добавить(Перечисления.ВидыЭДОбменСБанками.РеестрЧековВыплатСамозанятым);
	
КонецПроцедуры

// Используется для получения номеров счетов в виде массив строк
//
// Параметры:
//  Организация - <СправочникСсылка.Организации> - отбор по организации.
//  Банк - <СправочникСсылка.КлассификаторБанковРФ> - отбор по банку.
//  МассивНомеровБанковскихСчетов - массив возврата, в элементах строки с номерами счетов
//
Процедура ПолучитьНомераБанковскихСчетов(Организация, Банк, МассивНомеровБанковскихСчетов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БанковскиеСчета.НомерСчета КАК НомерСчета
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |ГДЕ
	               |	(БанковскиеСчета.Банк = &Банк
	               |			ИЛИ БанковскиеСчета.Банк.Код = &БИК)
	               |	И БанковскиеСчета.Владелец = &Организация
	               |	И НЕ БанковскиеСчета.ПометкаУдаления
	               |	И (БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	               |			ИЛИ БанковскиеСчета.ДатаЗакрытия > &НачалоТекущегоДня)";
	
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("БИК",				ОбменСБанкамиСлужебный.БИК(Банк));
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("НачалоТекущегоДня",	НачалоДня(ТекущаяДатаСеанса()));
	ТабРез = Запрос.Выполнить().Выгрузить();
	МассивНомеровБанковскихСчетов = ТабРез.ВыгрузитьКолонку("НомерСчета");
	
КонецПроцедуры

// Определяет параметры электронного документа по типу владельца.
//
// Параметры:
//  Источник - объекта либо ссылка документа/справочника-источника.
//  ПараметрыЭД - структура параметров источника, необходимых для определения
//                настроек обмена ЭД. Обязательные параметры: ВидЭД, Банк, Организация.
//
Процедура ЗаполнитьПараметрыЭДПоИсточнику(Источник, ПараметрыЭД) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("ДокументСсылка.ПлатежноеПоручение")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПлатежноеПоручение") Тогда
		
		ПараметрыЭД.ВидЭД = Перечисления.ВидыЭДОбменСБанками.ПлатежноеПоручение;
		ПараметрыЭД.Организация = Источник.Организация;
		СчетОрганизации = Источник.БанковскийСчет;
		Если ЗначениеЗаполнено(СчетОрганизации) Тогда
			ПараметрыЭД.Банк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетОрганизации, "Банк");
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ВыплатыСамозанятым")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ВыплатыСамозанятым") Тогда

		ПараметрыЭД.ВидЭД = Перечисления.ВидыЭДОбменСБанками.РеестрВыплатСамозанятым;
		Если ЗначениеЗаполнено(Источник.Организация) И ЗначениеЗаполнено(Источник.СчетОрганизации) Тогда
			ПараметрыЭД.Организация = Источник.Организация;
			ПараметрыЭД.Банк = Источник.СчетОрганизации.Банк;
		Иначе
			ДанныеПлатежногоПоручения = ОбменСБанкамиВыплатыСамозанятымСлужебный.ДанныеПлатежногоПоручения();
			ОбменСБанкамиВыплатыСамозанятымПереопределяемый.ДанныеПлатежногоПорученияРеестраВыплатСамозанятым(Источник,
				ДанныеПлатежногоПоручения);				
			Если ЗначениеЗаполнено(ДанныеПлатежногоПоручения) И ТипЗнч(ДанныеПлатежногоПоручения) = Тип("Структура") Тогда		
				ПараметрыЭД.Организация = ДанныеПлатежногоПоручения.Организация;
				ПараметрыЭД.Банк = ДанныеПлатежногоПоручения.Банк;						
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Платежное поручение.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы
//                          электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПлатежноеПоручение из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо
//           дерева значений.
//
Процедура ЗаполнитьДанныеПлатежныхПоручений(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
	Счетчик = 0;
	Для Каждого СсылкаНаОбъект Из МассивСсылок Цикл
		
		ДеревоДокумента = ДанныеДляЗаполнения.Получить(Счетчик);
		Счетчик = Счетчик + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлатежноеПоручение.Номер КАК Номер,
		|	ПлатежноеПоручение.Дата КАК Дата,
		|	ПлатежноеПоручение.СуммаДокумента КАК Сумма,
		|	ПлатежноеПоручение.ТекстПолучателя КАК РеквизитыПолучателя_Наименование,
		|	ПлатежноеПоручение.ИННПолучателя КАК РеквизитыПолучателя_ИНН,
		|	ПлатежноеПоручение.КПППолучателя КАК РеквизитыПолучателя_КПП,
		|	ПлатежноеПоручение.СчетКонтрагента.НомерСчета КАК РеквизитыПолучателя_РасчСчет,
		|	ПлатежноеПоручение.СчетКонтрагента.Банк.Код КАК РеквизитыПолучателя_Банк_БИК,
		|	ПлатежноеПоручение.СчетКонтрагента.Банк.Наименование КАК РеквизитыПолучателя_Банк_Наименование,
		|	ПлатежноеПоручение.СчетКонтрагента.Банк.Город КАК РеквизитыПолучателя_Банк_Город,
		|	ПлатежноеПоручение.СчетКонтрагента.Банк.КоррСчет КАК РеквизитыПолучателя_Банк_КоррСчет,
		|	ПлатежноеПоручение.СчетКонтрагента.Банк КАК СчетПолучателяБанк,
		|	ПлатежноеПоручение.ТекстПлательщика КАК РеквизитыПлательщика_Наименование,
		|	ПлатежноеПоручение.ИННПлательщика КАК РеквизитыПлательщика_ИНН,
		|	ПлатежноеПоручение.КПППлательщика КАК РеквизитыПлательщика_КПП,
		|	ПлатежноеПоручение.БанковскийСчет.НомерСчета КАК РеквизитыПлательщика_РасчСчет,
		|	ПлатежноеПоручение.БанковскийСчет.Банк.Код КАК РеквизитыПлательщика_Банк_БИК,
		|	ПлатежноеПоручение.БанковскийСчет.Банк.Наименование КАК РеквизитыПлательщика_Банк_Наименование,
		|	ПлатежноеПоручение.БанковскийСчет.Банк.Город КАК РеквизитыПлательщика_Банк_Город,
		|	ПлатежноеПоручение.БанковскийСчет.Банк.КоррСчет КАК РеквизитыПлательщика_Банк_КоррСчет,
		|	ПлатежноеПоручение.БанковскийСчет.Банк КАК СчетОрганизацииБанк,
		|	ПлатежноеПоручение.ВидПлатежа КАК РеквизитыПлатежа_ВидПлатежа,
		|	""01"" КАК РеквизитыПлатежа_ВидОплаты,
		|	ПлатежноеПоручение.ОчередностьПлатежа КАК РеквизитыПлатежа_Очередность,
		|	ПлатежноеПоручение.ИдентификаторПлатежа КАК РеквизитыПлатежа_Код,
		|	ПлатежноеПоручение.НазначениеПлатежа КАК РеквизитыПлатежа_НазначениеПлатежа,
		|	ВЫБОР
		|		КОГДА ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ЛичныеСредстваПредпринимателя)
		|				ИЛИ ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ПереводНаДругойСчет)
		|			ТОГДА ПлатежноеПоручение.Организация
		|		КОГДА ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.Подотчетнику)
		|				ИЛИ ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику)
		|			ТОГДА ПлатежноеПоручение.Подотчетник
		|		ИНАЧЕ ПлатежноеПоручение.Контрагент
		|	КОНЕЦ КАК Получатель,
		|	ВЫБОР
		|		КОГДА ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПеречислениеВБюджет,
		|	ПлатежноеПоручение.СтатусСоставителя КАК ПлатежиВБюджет_СтатусСоставителя,
		|	ПлатежноеПоручение.КодБК КАК ПлатежиВБюджет_ПоказательКБК,
		|	ПлатежноеПоручение.КодОКАТО КАК ПлатежиВБюджет_ОКТМО,
		|	ПлатежноеПоручение.ПоказательОснования КАК ПлатежиВБюджет_ПоказательОснования,
		|	ВЫБОР
		|		КОГДА ПлатежноеПоручение.ПоказательПериода = """"
		|			ТОГДА ""0""
		|		ИНАЧЕ ПлатежноеПоручение.ПоказательПериода
		|	КОНЕЦ КАК ПлатежиВБюджет_ПоказательПериода,
		|	ВЫБОР
		|		КОГДА ПлатежноеПоручение.ПоказательНомера = """"
		|			ТОГДА ""0""
		|		ИНАЧЕ ПлатежноеПоручение.ПоказательНомера
		|	КОНЕЦ КАК ПлатежиВБюджет_ПоказательНомера,
		|	ПлатежноеПоручение.ПоказательДаты КАК ПоказательДаты,
		|	ПлатежноеПоручение.Организация.Префикс КАК Префикс,
		|	ПлатежноеПоручение.КодВидаДохода КАК КодВидаДохода,
		|	ПлатежноеПоручение.КодВыплат КАК КодВыплат
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|ГДЕ
		|	ПлатежноеПоручение.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаДокументов.Количество()>0 Тогда
			
			ПлатежноеПоручение = ТаблицаДокументов[0];
			
			НомерДокумента = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.НомерОбъектаБезПрефикса(ПлатежноеПоручение.Номер);
			ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
				СсылкаНаОбъект, "Номер");
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДокумента, "Номер", НомерДокумента, ПараметрыОбработкиОшибок);
				
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "Дата",
				ПлатежноеПоручение.Дата);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "Сумма",
				ПлатежноеПоручение.Сумма);
				
			ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
				ПлатежноеПоручение.СчетОрганизацииБанк, "Город");
				
			ЭлектронноеВзаимодействие.ДобавитьВРеквизитОбработкуОшибки(
				ДеревоДокумента, "РеквизитыПлательщика.Банк.Город", ПараметрыОбработкиОшибок);
			
			ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
				ПлатежноеПоручение.СчетПолучателяБанк, "Город");
				
			ЭлектронноеВзаимодействие.ДобавитьВРеквизитОбработкуОшибки(
				ДеревоДокумента, "РеквизитыПолучателя.Банк.Город", ПараметрыОбработкиОшибок);
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.ВидПлатежа",
				ПлатежноеПоручение.РеквизитыПлатежа_ВидПлатежа);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.Очередность",
				ПлатежноеПоручение.РеквизитыПлатежа_Очередность);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.Код",
				ПлатежноеПоручение.РеквизитыПлатежа_Код);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.НазначениеПлатежа",
				ПлатежноеПоручение.РеквизитыПлатежа_НазначениеПлатежа);
				
			Если ЗначениеЗаполнено(ПлатежноеПоручение.КодВидаДохода) Тогда
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.КодВидаДохода",
					ПлатежноеПоручение.КодВидаДохода);
			КонецЕсли;
				
			// Плательщик
			РеквизитыПлательщика_Наименование = ПлатежноеПоручение.РеквизитыПлательщика_Наименование;
			ПозицияРС = СтрНайти(РеквизитыПлательщика_Наименование, "р/с");
			Если ПозицияРС > 0 Тогда
				РеквизитыПлательщика_Наименование = СокрЛП((Лев(РеквизитыПлательщика_Наименование, ПозицияРС-1)));
			КонецЕсли;
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Наименование",
				РеквизитыПлательщика_Наименование);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.ИНН",
				ПлатежноеПоручение.РеквизитыПлательщика_ИНН);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.КПП",
				ПлатежноеПоручение.РеквизитыПлательщика_КПП);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.РасчСчет",
				ПлатежноеПоручение.РеквизитыПлательщика_РасчСчет);
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Банк.БИК",
				ПлатежноеПоручение.РеквизитыПлательщика_Банк_БИК);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Банк.Наименование",
				ПлатежноеПоручение.РеквизитыПлательщика_Банк_Наименование);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Банк.Город",
				ПлатежноеПоручение.РеквизитыПлательщика_Банк_Город);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Банк.КоррСчет",
				ПлатежноеПоручение.РеквизитыПлательщика_Банк_КоррСчет);
			
			// Получатель
			РеквизитыПолучателя_Наименование = ПлатежноеПоручение.РеквизитыПолучателя_Наименование;
			ПозицияРС = СтрНайти(РеквизитыПолучателя_Наименование, "р/с");
			Если ПозицияРС > 0 Тогда
				РеквизитыПолучателя_Наименование = СокрЛП((Лев(РеквизитыПолучателя_Наименование, ПозицияРС-1)));
			КонецЕсли;
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Наименование",
				РеквизитыПолучателя_Наименование);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.ИНН",
				ПлатежноеПоручение.РеквизитыПолучателя_ИНН);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.КПП",
				ПлатежноеПоручение.РеквизитыПолучателя_КПП);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.РасчСчет",
				ПлатежноеПоручение.РеквизитыПолучателя_РасчСчет);
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Банк.БИК",
				ПлатежноеПоручение.РеквизитыПолучателя_Банк_БИК);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Банк.Наименование",
				ПлатежноеПоручение.РеквизитыПолучателя_Банк_Наименование);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Банк.Город",
				ПлатежноеПоручение.РеквизитыПолучателя_Банк_Город);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Банк.КоррСчет",
				ПлатежноеПоручение.РеквизитыПолучателя_Банк_КоррСчет);
				
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПлатежиВБюджет",
				ПлатежноеПоручение.ПеречислениеВБюджет);
				
			// Платежи в бюджет
			Если ПлатежноеПоручение.ПеречислениеВБюджет Тогда
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПлатежиВБюджет.СтатусСоставителя",
					ПлатежноеПоручение.ПлатежиВБюджет_СтатусСоставителя);
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПлатежиВБюджет.ПоказательКБК",
					ПлатежноеПоручение.ПлатежиВБюджет_ПоказательКБК);
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПлатежиВБюджет.ОКТМО",
					ПлатежноеПоручение.ПлатежиВБюджет_ОКТМО);
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПлатежиВБюджет.ПоказательОснования",
					ПлатежноеПоручение.ПлатежиВБюджет_ПоказательОснования);
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПлатежиВБюджет.ПоказательПериода",
					ПлатежноеПоручение.ПлатежиВБюджет_ПоказательПериода);
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПлатежиВБюджет.ПоказательНомера",
					ПлатежноеПоручение.ПлатежиВБюджет_ПоказательНомера);
					
				ПоказательДатыСтрокой = Формат(ПлатежноеПоручение.ПоказательДаты, "ДФ=dd.MM.yyyy");
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПлатежиВБюджет.ПоказательДаты",
					ПоказательДатыСтрокой);
				
			КонецЕсли;
				
			Если ЗначениеЗаполнено(ПлатежноеПоручение.КодВыплат) Тогда
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПлатежиВБюджет.КодВыплат",
					ПлатежноеПоручение.КодВыплат);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Платежное требование.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы
//                          электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПлатежноеТребование из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо
//           дерева значений.
//
Процедура ЗаполнитьДанныеПлатежныхТребований(МассивСсылок, ДанныеДляЗаполнения) Экспорт

КонецПроцедуры

// Подготавливает данные для электронного документа типа Поручение на перевод валюты.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы
//                          электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПоручениеНаПереводВалюты из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо
//           дерева значений.
//
Процедура ЗаполнитьДанныеПорученийНаПереводВалюты(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Поручение на покупку валюты.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы
//                          электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПоручениеНаПокупкуВалюты из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо
//           дерева значений.
//
Процедура ЗаполнитьДанныеПорученийНаПокупкуВалюты(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Поручение на продажу валюты.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы
//                          электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПоручениеНаПродажуВалюты из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо
//           дерева значений.
//
Процедура ЗаполнитьДанныеПорученийНаПродажуВалюты(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Распоряжение на обязательную продажу валюты.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы
//                          электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета РаспоряжениеНаОбязательнуюПродажуВалюты из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо
//           дерева значений.
//
Процедура ЗаполнитьДанныеРаспоряженийНаОбязательнуюПродажуВалюты(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Справка о подтверждающих документах.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы
//                          электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета СправкаОПодтверждающихДокументах из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо
//           дерева значений.
//
Процедура ЗаполнитьДанныеСправокОПодтверждающихДокументах(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Вызывается при получении уведомления о зачислении валюты
//
// Параметры:
//  ДеревоРазбора - ДеревоЗначений - дерево данных, соответствующее макету Обработки.ОбменСБанками.УведомлениеОЗачислении
//  НовыйДокументСсылка - ДокументСсылка - ссылка на созданный документ на основании данных электронного документа.
//
Процедура ПриПолученииУведомленияОЗачислении(ДеревоРазбора, НовыйДокументСсылка) Экспорт
	
КонецПроцедуры

// Включает тестовый режим обмена в банком.
// При включении тестового режима возможно ручное указание URL сервера для получения настроек обмена.
//
// Параметры:
//    Используется - Булево - признак использования тестового режима.
//
Процедура ПроверитьИспользованиеТестовогоРежима(ИспользуетсяТестовыйРежим) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Найти(ВРег(Константы.ЗаголовокСистемы.Получить()), ВРег("DirectBank")) > 0 Тогда
		
		ИспользуетсяТестовыйРежим = Истина;
		
	Иначе
		
		ИспользуетсяТестовыйРежим = Константы.ИспользоватьТестовыйРежимDirectBank.Получить();
		
	КонецЕсли;
	
КонецПроцедуры

// Событие возникает при получении выписки из регламентного задания или при синхронизации.
// Необходимо создать документы в информационной базе для отражения произведенных по счету операций.
// Для получения данных выписки в удобном формате можно использовать следующие процедуры:
//  - ОбменСБанками.ПолучитьДанныеВыпискиБанкаДеревоЗначений()
//  - ОбменСБанками.ПолучитьДанныеВыпискиБанкаТекстовыйФормат() - только для рублевых выписок.
//
// Параметры:
//  СообщениеОбмена - ДокументСсылка.СообщениеОбменСБанками - ссылка на сообщение обмена, содержащий выписку банка.
//
Процедура ПриПолученииВыписки(СообщениеОбмена) Экспорт
	
	АдресХранилища = "";
	УникальныйИдентификатор = Новый УникальныйИдентификатор();
	
	Выписки = Новый Массив;
	Выписки.Добавить(СообщениеОбмена);
	АдресВыписки = ЭлектронноеВзаимодействиеБПВызовСервера.ДанныеВыписокБанкаВКоллекцию(Выписки);
	
	МассивСчетов = Новый Массив;
	ВыпискаБанка = ЭлектронноеВзаимодействиеБПВызовСервера.ПрочитанныеДанныеСервиса(Выписки, МассивСчетов);
	
	Если ВыпискаБанка.ДанныеИзБанка.Документы.Количество() = 0 Тогда
		Результат = Новый Структура;
		Результат.Вставить("Статус", "Ошибка");
		Результат.Вставить("КраткоеПредставлениеОшибки",   "");
		Результат.Вставить("ПодробноеПредставлениеОшибки", "");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("АдресХранилищаРаспознанныеДанныеИзБанка",
		ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
	СтруктураПараметров.Вставить("Кодировка",    Неопределено);
	СтруктураПараметров.Вставить("ВыпискаБанка", ВыпискаБанка);
	
	СведенияОВладельцеБанковскогоСчетаИзКонтекста = Новый Структура;
	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Вставить("Организация",               Новый Массив);
	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Вставить("БанковскийСчетОрганизации", Новый Массив);
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СообщениеОбмена, "Организация");
	СведенияОВладельцеБанковскогоСчетаИзКонтекста.Организация.Добавить(Организация);
	СтруктураПараметров.Вставить("СведенияОВладельцеБанковскогоСчетаИзКонтекста", СведенияОВладельцеБанковскогоСчетаИзКонтекста);
	
	Обработки.КлиентБанк.ФоноваяЗагрузкаБанковскойВыпискиИзЖурнала(СтруктураПараметров, АдресХранилища, Истина);
	
КонецПроцедуры

// Вызывается однократно при первом формировании списка команд, выводимых в форме конкретного объекта конфигурации.
// Возможно изменение значений структуры в параметре Команды. Например, можно добавить условие видимости команды.
//
// Параметры:
//   НастройкиФормы - Структура - см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
//   Источники - ДеревоЗначений - см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
//   ПодключенныеОтчетыИОбработки - см.ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
//   Команды - ФиксированнаяСтруктура - команды, добавленные подсистемой ОбменСБанками.
//   	* Ключ - Строка - Идентификатор добавленной команды. Может содержать следующие значения:
//   		"ДиректБанкОтправка", "ДиректБанкПросмотр", "ДиректБанкСоздать", "ДиректБанкСписок", "ДиректБанкВыписки",
//   		"ДиректБанкПисьма"
//   	* Значение - СтрокаТаблицыЗначений - структура таблицы описана
//          в ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
//@skip-warning пустая процедура в БЭД
Процедура ПриОпределенииКомандДиректБанк(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
КонецПроцедуры

// Проверяет доступность функциональности отправки почтовых сообщений 
//
// Параметры:
//   ЭлектроннаяПочтаПоддерживается - Булево
//
Процедура ПроверитьДоступностьФункциональностиЭлектроннойПочты(ЭлектроннаяПочтаПоддерживается) Экспорт
	
	ЭлектроннаяПочтаПоддерживается = Истина;
	
КонецПроцедуры

#Область ЗарплатныйПроект

// Вызывается для формирования XML файла в прикладном решении
//
// Параметры:
//    ОбъектДляВыгрузки = ДокументСсылка - ссылка на документ, на основании которого будет сформирован ЭД.
//    ИмяФайла - Строка - имя сформированного файла
//    АдресФайла - АдресВременногоХранилища - содержит двоичные данные файла
//
Процедура ПриФормированииXMLФайла(ОбъектДляВыгрузки, ИмяФайла, АдресФайла) Экспорт
	
КонецПроцедуры

// Формирует табличный документ на основании файла XML для визуального отображения электронного документа.
//
// Параметры:
//  ИмяФайла - Строка - полный путь к файлу XML
//  ТабличныйДокумент - ТабличныйДокумент - возвращаемое значение, визуальное отображение данных файла.
//
Процедура ЗаполнитьТабличныйДокумент(Знач ИмяФайла, ТабличныйДокумент) Экспорт
	
КонецПроцедуры

// Вызывается при получении файла из банка
//
// Параметры:
//   АдресДанныхФайла - Строка - адрес временного хранилища с двоичными данными файла.
//   ИмяФайла - Строка - формализованное имя файла данных
//   ИдентификаторЭДВладельца - Строка - (возвращаемый параметр) идентификатор ЭД, на основании которого был получен
//                                       ответ из банка.
//   ОбъектВладелец - ДокументСсылка - (возвращаемый параметр) ссылка на документ, который был создан на основании ЭД.
//   ДанныеОповещения - Структура - (возвращаемый параметр) данные для вызова метода Оповестить на клиенте.
//                 * Ключ - Строка - имя события
//                 * Значение - Произвольный - параметр сообщения
Процедура ПриПолученииXMLФайла(АдресДанныхФайла, ИмяФайла, ОбъектВладелец, ДанныеОповещения) Экспорт
	
КонецПроцедуры

// Вызвается при изменении состояния элекронного документооборота.
//
// Параметры:
//  СсылкаНаОбъект - ДокументСсылка - владелец электронного документооборота;
//  СостояниеЭД - ПеречислениеСсылка.СостоянияОбменСБанками - новое состояние электронного документооборота.
//
Процедура ПриИзмененииСостоянияЭД(СсылкаНаОбъект, СостояниеЭД) Экспорт
	
	СостояниеСтрокой = ОбменСБанками.СостояниеБанковскогоДокументаСтрокой(СостояниеЭД);
	РегистрыСведений.СостоянияБанковскихДокументов.УстановитьСостояниеДокумента(СсылкаНаОбъект, СостояниеСтрокой);
	
КонецПроцедуры

#КонецОбласти

// Позволяет скорректировать входящие параметры перед обработкой электронных документов.
//
// Параметры:
//  Параметры - Структура - параметры обработки электронных документов, содержит поля:
//   * МассивСсылокНаОбъект - Массив - содержит ссылки на документы, которые необходимо обработать;
//   * МассивОтпечатковСертификатов - Массив - отпечатки доступных сертификатов на клиенте;
//   * Действия - Строка - последовательность необходимых действий с электронным документом;
//   * СообщениеОбмена - ДокументСсылка.СообщениеОбменСБанками - ссылка сообщение обмена, который нужно обработать;
//   * СессииОбменСБанками - Соответствие - существующие сессии обмена со Сбербанком
//                         - Неопределено - нет установленных сессий.
//   * Фрод - Структура - содержит адреса сетевого оборудования клиента: 
//   	** MAC - Массив из Строка - MAC адреса сетевого оборудования клиента.
//   	** IP - Массив из Строка - IP адреса сетевого оборудования клиента.
//   	** IPАдресКлиента - Строка - IP адрес клиента с точки зрения сервера.
//
Процедура ПередОбработкойЭлектронныхДокументов(Параметры) Экспорт

	// Для данной конфигурации процедура позволяет  добавить в массив выгружаемых документов связанный документ.
	// Для того, чтобы параллельно с платежным поручением отправить в банк Реестр выплат самозанятым,
	//  и только в том случае, если до этого Реестр выплат уже не был отправлен отдельно.
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПлатежноеПоручение.РеестрВыплатСамозанятым КАК РеестрВыплатСамозанятым,
	|	ЕСТЬNULL(СостоянияОбменСБанками.СообщениеОбмена, ЗНАЧЕНИЕ(Документ.СообщениеОбменСБанками.ПустаяСсылка)) КАК СообщениеОбмена
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОбменСБанками КАК СостоянияОбменСБанками
	|		ПО ПлатежноеПоручение.РеестрВыплатСамозанятым = СостоянияОбменСБанками.СсылкаНаОбъект
	|ГДЕ
	|	ПлатежноеПоручение.Ссылка В(&МассивДокументов)
	|	И ПлатежноеПоручение.РеестрВыплатСамозанятым <> ЗНАЧЕНИЕ(Документ.ВыплатыСамозанятым.ПустаяСсылка)
	|	И ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ВыплатыСамозанятым)
	|	И ЕСТЬNULL(СостоянияОбменСБанками.СообщениеОбмена, ЗНАЧЕНИЕ(Документ.СообщениеОбменСБанками.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.СообщениеОбменСБанками.ПустаяСсылка)";
	Запрос.УстановитьПараметр("МассивДокументов", Параметры.МассивСсылокНаОбъект);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Параметры.МассивСсылокНаОбъект.Добавить(Выборка.РеестрВыплатСамозанятым);
	КонецЦикла;
	
КонецПроцедуры 

// Процедура добавляет связанные документы для прикладной конфигурации
//
// Параметры:
//
//		ТекущийДокумент - ДокументСсылка - ссылка на документ, для которого нужно добавить связанный документ
//      МассивДокументов - Массив - массив документов, в который необходимо добавить связанные документы для прикладной конфигурации
//
Процедура ДобавитьСвязанныеДокументы(ТекущийДокумент, МассивДокументов) Экспорт
		
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ВыплатыСамозанятым") Тогда
		Запрос = Новый Запрос;
		ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПлатежноеПоручение.Ссылка КАК Ссылка,
			|	ПлатежноеПоручение.Дата КАК Дата
			|ИЗ
			|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
			|ГДЕ
			|	ПлатежноеПоручение.РеестрВыплатСамозанятым = &РеестрВыплатСамозанятым
			|	И ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ВыплатыСамозанятым)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПлатежноеПоручение.Дата УБЫВ";    
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("РеестрВыплатСамозанятым", ТекущийДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда                                                                  
			МассивДокументов.Добавить(Выборка.Ссылка);
			МассивДокументов.Добавить(ТекущийДокумент);
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		Запрос = Новый Запрос;
		ТекстЗапроса =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПлатежноеПоручение.РеестрВыплатСамозанятым КАК РеестрВыплатСамозанятым,
			|	ПлатежноеПоручение.Дата КАК Дата
			|ИЗ
			|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
			|ГДЕ
			|	ПлатежноеПоручение.Ссылка = &Ссылка
			|	И ПлатежноеПоручение.РеестрВыплатСамозанятым <> ЗНАЧЕНИЕ(Документ.ВыплатыСамозанятым.ПустаяСсылка)
			|	И ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ВыплатыСамозанятым)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПлатежноеПоручение.Дата УБЫВ";
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда                                                                  
			МассивДокументов.Добавить(ТекущийДокумент);
			МассивДокументов.Добавить(Выборка.РеестрВыплатСамозанятым);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Для выполнения действий после отправки электронных документов в прикладной конфигурации
//
// Параметры:
//   РезультатОтправки - Структура - результат выполнения предыдущей процедуры СформироватьИОтправитьПакетыВБанк
//     * КоличествоПодготовленных - Число - количество подготовленных документов
//     * ОтправленныеДокументы - Массив - содержит ссылки на документы, которые были отправлены
//     * ОтправленныеСообщенияОбмена - Массив - содержит ссылки на ДокументСсылка.СообщениеОбменСБанками, которые были отправлены
//
Процедура ПослеОтправкиЭД(РезультатОтправки) Экспорт
			
	// Назначим документу "Выплаты самозанятым" статус "Отправлено"
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СообщениеОбменСБанками.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(СвязанныеОбъектыОбменСБанками.СсылкаНаОбъект, ЗНАЧЕНИЕ(Документ.ВыплатыСамозанятым.ПустаяСсылка)) КАК СсылкаНаОбъект
	|ИЗ
	|	Документ.СообщениеОбменСБанками КАК СообщениеОбменСБанками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеОбъектыОбменСБанками КАК СвязанныеОбъектыОбменСБанками
	|		ПО СообщениеОбменСБанками.Ссылка = СвязанныеОбъектыОбменСБанками.СообщениеОбмена
	|ГДЕ
	|	СообщениеОбменСБанками.ВидЭД = &ВидЭД
	|	И СообщениеОбменСБанками.Статус = &Статус
	|	И СообщениеОбменСБанками.Ссылка В(&ОтправленныеСообщенияОбмена)
	|	И СвязанныеОбъектыОбменСБанками.СсылкаНаОбъект ССЫЛКА Документ.ВыплатыСамозанятым";
	Запрос.УстановитьПараметр("ВидЭД", Перечисления.ВидыЭДОбменСБанками.РеестрВыплатСамозанятым);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыОбменСБанками.Отправлен);
	Запрос.УстановитьПараметр("ОтправленныеСообщенияОбмена", РезультатОтправки.ОтправленныеСообщенияОбмена);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		НовыеСтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
		НовыеСтатусыДокумента.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.Отправлено;
		РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(Выборка.СсылкаНаОбъект, НовыеСтатусыДокумента);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
